---
kind: method
id: M:Autodesk.Revit.DB.Form.IsBeginningFace(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/d2342e18-d33b-b748-bab2-f28c39e70f77.htm
---
# Autodesk.Revit.DB.Form.IsBeginningFace Method

**中文**: 对话框、窗口、窗体

Given a face, tell if it is a beginning cap face.

## Syntax (C#)
```csharp
public bool IsBeginningFace(
	Reference faceReference
)
```

## Parameters
- **faceReference** (`Autodesk.Revit.DB.Reference`) - The reference of the face to be checked.